CS/TrackRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v10="http://fedex.com/ws/track/v10">
   <soapenv:Header/>
   <soapenv:Body>
      <v10:TrackRequest>
         <v10:WebAuthenticationDetail>
            <!--Optional:-->
            <v10:ParentCredential>
               <v10:Key>@P1</v10:Key>
               <v10:Password>@P2</v10:Password>
            </v10:ParentCredential>
            <v10:UserCredential>
               <v10:Key>@P3</v10:Key>
               <v10:Password>@P4</v10:Password>
            </v10:UserCredential>
         </v10:WebAuthenticationDetail>
         <v10:ClientDetail>
            <v10:AccountNumber>@P5</v10:AccountNumber>
            <v10:MeterNumber>@P6</v10:MeterNumber><v10:IntegratorId>123456</v10:IntegratorId>
            <!--Optional:-->
            
            <!--Optional:-->
            
         </v10:ClientDetail>
         <!--Optional:-->
         
         <v10:Version>
            <v10:ServiceId>trck</v10:ServiceId>
            <v10:Major>10</v10:Major>
            <v10:Intermediate>0</v10:Intermediate>
            <v10:Minor>0</v10:Minor>
         </v10:Version>
         <!--Zero or more repetitions:-->
         
         <!--Optional:-->
         
         <!--Zero or more repetitions:-->
         <v10:SelectionDetails>
		     <v10:PackageIdentifier>
			    <v10:Type>TRACKING_NUMBER_OR_DOORTAG</v10:Type>
				<v10:Value>@P7</v10:Value>
		    </v10:PackageIdentifier>
		</v10:SelectionDetails>
		<v10:ProcessingOptions>INCLUDE_DETAILED_SCANS</v10:ProcessingOptions>
      </v10:TrackRequest>
   </soapenv:Body>
</soapenv:Envelope>